// 3 Ëàáîðàòîðíàÿ ðàáîòà
// Äâóìåðíûé äèíàìè÷åñêèé ìàññèâ

#include <iostream> //Îðãàíèçàöèÿ ââîäà-âûâîäà

using namespace std; // Ïðîñòðàíñòâî èìåí std

// Îáúÿâëåíèå ïåðåìåííûõ
int n, y, i, j, **x;

int main() // Îñíîâíîå òåëî ïðîãðàììû
{
    setlocale(LC_ALL, "Russian");
    cin >> n;
    cin >> y;
    x = new int *[n]; //выделение памяти для массива указателей
    for (i = 0; i < n; i++) //выделение памяти для отдельного массива (условно строка)
        x[i] = new int[y];

    for (i = 0; i < n; i++)
        for (j = 0; j < y; j++)
            x[i][j] = rand() %20;


for (i = 0; i < n; i++)
{
cout<<"\n";
        for (j = 0; j < y; j++)
            cout << "a["<<i<<"]"<<"["<<j<<"] = 4"<<x[i][j]<<"  " ;



}
}
